Revit 2026 API

# WorksetTable Class

---

A table containing references to all the worksets contained in a document.

SystemObject Autodesk.Revit.DBWorksetTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WorksetTable : IDisposable
```
```vb
Public Class WorksetTable
	Implements IDisposable
```
```cpp
public ref class WorksetTable : IDisposable
```
```fsharp
type WorksetTable =
    class
        interface IDisposable
    end
```

The WorksetTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | CanDeleteWorkset | Indicates if a workset can be deleted. |
|  | DeleteWorkset | Delete the specific workset. |
|  | Dispose | Releases all resources used by the WorksetTable |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetActiveWorksetId | Returns the active workset's WorksetId. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWorkset(Guid) | Returns the workset from a input Guid. |
|  | GetWorkset(WorksetId) | Returns the workset from a input WorksetId. |
|  | IsWorksetNameUnique | Checks if the given workset name is unique in the document. |
|  | RenameWorkset | Renames the workset. |
|  | SetActiveWorksetId | Sets the active workset. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

There is one WorksetTable for each document. There will be at least one default workset in the table, even if worksharing has not been enabled in the document.

#### Reference

Autodesk.Revit.DB Namespace